Repository: Hike-12/BitNBuild25_TeamPony
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: hi

# appTitle
source: NourishNet - Tiffin Service
hi: नरिशनेट - टिफिन सेवा

# welcome
source: Welcome back
hi: वापसी पर स्वागत

# welcomeMessage
source: Welcome to NourishNet
hi: नरिशनेट में आपका स्वागत है

source: Select Language
hi: भाषा चुनें

source: Dashboard
hi: डैशबोर्ड

source: Menu
hi: मेन्यू

source: Premium
hi: प्रीमियम

source: Profile
hi: प्रोफाइल

source: Login
hi: लॉग इन

source: Register
hi: पंजीकरण

source: Email
hi: ईमेल

source: Password
hi: पासवर्ड

source: Username
hi: उपयोगकर्ता नाम

source: Login successful!
hi: लॉगिन सफल!

# loginFailed
source: Login failed. Please check your credentials.
hi: लॉगिन असफल। कृपया अपनी जानकारी जांचें।

source: My Subscriptions
hi: मेरी सदस्यताएं

source: Meals Progress
hi: भोजन की प्रगति

source: Price per Meal
hi: प्रति भोजन मूल्य

source: Unknown Vendor
hi: अज्ञात विक्रेता

source: Curated Culinary Excellence
hi: चुनिंदा पाक उत्कृष्टता

source: Sophisticated Dining Experience
hi: परिष्कृत भोजन अनुभव

source: Premium Local Gastronomy
hi: प्रीमियम स्थानीय पाकशास्त्र

# discoverArtisanalFlavors
source: Discover artisanal flavors from the finest local establishments
hi: बेहतरीन स्थानीय प्रतिष्ठानों से शिल्पकारी स्वादों की खोज करें

# exceptionalTasteService
source: Where exceptional taste meets unparalleled service
hi: जहां असाधारण स्वाद अतुलनीय सेवा से मिलता है

# elevatingNeighborhoodDining
source: Elevating neighborhood dining to extraordinary heights
hi: पड़ोसी भोजन को असाधारण ऊंचाइयों तक ले जाना

source: Your Culinary Journey
hi: आपकी पाक यात्रा

source: Elite Rewards
hi: एलीट रिवार्ड्स

source: Culinary Achievements
hi: पाक उपलब्धियां

source: VIP Recognition
hi: वीआईपी पहचान

# exclusivePrivileges
source: Exclusive privileges and premium benefits with every curated experience
hi: हर चुनिंदा अनुभव के साथ विशेष सुविधाएं और प्रीमियम लाभ

# unlockPrestigiousBadges
source: Unlock prestigious badges as you explore refined dining experiences
hi: परिष्कृत भोजन अनुभवों की खोज करते समय प्रतिष्ठित बैज अनलॉक करें

# distinguishedStatus
source: Distinguished status and personalized recommendations for connoisseurs
hi: रसिकों के लिए विशिष्ट स्थिति और व्यक्तिगत सिफारिशें

# startCulinaryJourney
source: Start Your Culinary Journey
hi: अपनी पाक यात्रा शुरू करें

# subscribeToPremium
source: Subscribe to premium dining experiences and unlock exclusive benefits
hi: प्रीमियम भोजन अनुभवों की सदस्यता लें और विशेष लाभ प्राप्त करें

source: Recent Culinary Experiences
hi: हाल की पाक अनुभव

source: Discover More
hi: और खोजें

source: Curated Menus
hi: चुनिंदा मेन्यू

# exploreHandpicked
source: Explore handpicked selections
hi: हस्तचयनित चयनों का अन्वेषण करें

source: Premium Plans
hi: प्रीमियम योजनाएं

source: Unlock exclusive benefits
hi: विशेष लाभ प्राप्त करें

source: Profile & Settings
hi: प्रोफाइल और सेटिंग्स

# personalizeExperience
source: Personalize your experience
hi: अपने अनुभव को व्यक्तिगत बनाएं

source: Loading...
hi: लोड हो रहा है...

source: Retry
hi: पुनः प्रयास

source: Cancel
hi: रद्द करें

source: Confirm
hi: पुष्टि करें

source: Save
hi: सहेजें

source: Edit
hi: संपादित करें

source: Delete
hi: हटाएं

source: Settings
hi: सेटिंग्स

source: Language
hi: भाषा

source: Theme
hi: थीम

source: Light Mode
hi: लाइट मोड

source: Dark Mode
hi: डार्क मोड
